#ifndef __MYGUI_H
#define __MYGUI_H

/*--------------------------------------------头文件-------------------------------------*/
#include "stm32F10x.h"
#include "sys.h"
/*---------------------------------------------常数--------------------------------------*/

/*--------------------------------------------宏定义-------------------------------------*/

/*---------------------------------------------变量--------------------------------------*/


/*---------------------------------------------类型--------------------------------------*/



/*---------------------------------------------函数--------------------------------------*/
void GUITransparentBlock(u16 X,u16 Y,u16 width,u16 height,u16 color,u8 aval);
void GUICharacter(uint16_t X, uint16_t Y,uint8_t Character, uint16_t Color,uint16_t Backlicolor,uint16_t Backl);
void GUIString(uint16_t X, uint16_t Y,uint8_t *StringPointer, uint16_t Color,uint16_t Backlicolor,uint16_t Backl);
#endif
